; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v9 ?v11)
             (pred_12 ?v13 ?v12)
             (pred_6 ?v9 ?v12)
             (pred_4 ?v6 ?v9 )
	     (pred_9 ?v9)
             (pred_5 ?v3)
             (pred_1 ?v13)
             (pred_8 ?v12)
             (pred_10 ?v9)
             (pred_3 ?v13)
             (pred_7 ?v9)
             (pred_2 ))



(:action op_3
:parameters (?v7 ?v8 ?v1 ?v2)
:precondition (and (pred_5 ?v7) (pred_5 ?v8) (pred_1 ?v1) (pred_8 ?v2)
          (pred_11 ?v7 ?v8) (pred_12 ?v1 ?v2)
                   (pred_6 ?v8 ?v2) (pred_9 ?v7) 
                   (pred_10 ?v8) (pred_3 ?v1))
:effect (and  (pred_7 ?v8) (not (pred_10 ?v8))))


(:action op_1
:parameters (?v7 ?v5)
:precondition (and (pred_5 ?v7) (pred_5 ?v5)
               (pred_9 ?v7) (pred_11 ?v7 ?v5) (pred_7 ?v5))
:effect (and (pred_9 ?v5) (not (pred_9 ?v7))))

(:action op_2
:parameters (?v7 ?v1)
:precondition (and (pred_5 ?v7) (pred_1 ?v1) 
                  (pred_9 ?v7) (pred_4 ?v1 ?v7) (pred_2 ))
:effect (and (pred_3 ?v1)
   (not (pred_4 ?v1 ?v7)) (not (pred_2 ))))


(:action op_5
:parameters (?v7 ?v4 ?v10)
:precondition (and (pred_5 ?v7) (pred_1 ?v4) (pred_1 ?v10)
                  (pred_9 ?v7) (pred_3 ?v10) (pred_4 ?v4 ?v7))
:effect (and (pred_3 ?v4) (pred_4 ?v10 ?v7)
        (not (pred_3 ?v10)) (not (pred_4 ?v4 ?v7))))

(:action op_4
:parameters (?v7 ?v1)
:precondition (and (pred_5 ?v7) (pred_1 ?v1) 
                  (pred_9 ?v7) (pred_3 ?v1))
:effect (and (pred_2 ) (pred_4 ?v1 ?v7) (not (pred_3 ?v1)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_04 obj_02 obj_07 obj_06 obj_10 obj_08 obj_19 obj_15 obj_16 obj_13 obj_20 obj_12 obj_03 obj_18 obj_14
    obj_21 obj_11
    obj_01 obj_05 obj_09
    )

    (:init
       (pred_2)

       (pred_5 obj_17)
       (pred_5 obj_04)
       (pred_5 obj_02)
       (pred_5 obj_07)
       (pred_5 obj_06)
       (pred_5 obj_10)
       (pred_5 obj_08)
       (pred_5 obj_19)
       (pred_5 obj_15)
       (pred_5 obj_16)
       (pred_5 obj_13)
       (pred_5 obj_20)
       (pred_5 obj_12)
       (pred_5 obj_03)
       (pred_5 obj_18)
       (pred_5 obj_14)
       (pred_8 obj_21)
       (pred_8 obj_11)
       (pred_1 obj_01)
       (pred_1 obj_05)
       (pred_1 obj_09)

       (pred_11 obj_17 obj_06)
       (pred_11 obj_17 obj_04)
       (pred_11 obj_04 obj_10)
       (pred_11 obj_04 obj_02)
       (pred_11 obj_04 obj_17)
       (pred_11 obj_02 obj_08)
       (pred_11 obj_02 obj_07)
       (pred_11 obj_02 obj_04)
       (pred_11 obj_07 obj_19)
       (pred_11 obj_07 obj_02)
       (pred_11 obj_06 obj_15)
       (pred_11 obj_06 obj_10)
       (pred_11 obj_06 obj_17)
       (pred_11 obj_10 obj_16)
       (pred_11 obj_10 obj_08)
       (pred_11 obj_10 obj_04)
       (pred_11 obj_10 obj_06)
       (pred_11 obj_08 obj_13)
       (pred_11 obj_08 obj_19)
       (pred_11 obj_08 obj_02)
       (pred_11 obj_08 obj_10)
       (pred_11 obj_19 obj_20)
       (pred_11 obj_19 obj_07)
       (pred_11 obj_19 obj_08)
       (pred_11 obj_15 obj_12)
       (pred_11 obj_15 obj_16)
       (pred_11 obj_15 obj_06)
       (pred_11 obj_16 obj_03)
       (pred_11 obj_16 obj_13)
       (pred_11 obj_16 obj_10)
       (pred_11 obj_16 obj_15)
       (pred_11 obj_13 obj_18)
       (pred_11 obj_13 obj_20)
       (pred_11 obj_13 obj_08)
       (pred_11 obj_13 obj_16)
       (pred_11 obj_20 obj_14)
       (pred_11 obj_20 obj_19)
       (pred_11 obj_20 obj_13)
       (pred_11 obj_12 obj_03)
       (pred_11 obj_12 obj_15)
       (pred_11 obj_03 obj_18)
       (pred_11 obj_03 obj_16)
       (pred_11 obj_03 obj_12)
       (pred_11 obj_18 obj_14)
       (pred_11 obj_18 obj_13)
       (pred_11 obj_18 obj_03)
       (pred_11 obj_14 obj_20)
       (pred_11 obj_14 obj_18)
       (pred_10 obj_18)
       (pred_10 obj_20)
       (pred_10 obj_17)
       (pred_6  obj_18 obj_21)
       (pred_6  obj_20 obj_11)
       (pred_6  obj_17 obj_21)
       (pred_7 obj_04)
       (pred_7 obj_02)
       (pred_7 obj_07)
       (pred_7 obj_06)
       (pred_7 obj_10)
       (pred_7 obj_08)
       (pred_7 obj_19)
       (pred_7 obj_15)
       (pred_7 obj_16)
       (pred_7 obj_13)
       (pred_7 obj_12)
       (pred_7 obj_03)
       (pred_7 obj_14)

       (pred_12  obj_01 obj_21)
       (pred_12  obj_05 obj_11)
       (pred_12  obj_09 obj_21)
       (pred_4 obj_01 obj_16)
       (pred_4 obj_05 obj_06)
       (pred_4 obj_09 obj_13)
       (pred_9 obj_08)
    )

    (:goal (and
       (pred_4 obj_05 obj_02)
       (pred_4 obj_09 obj_02)
    ))
(:constraints
  (always (not (pred_9 obj_10)))
)
)

; plan
1. (op_1 obj_08 obj_13)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_13)
   goals met: 0 of 2
2. (op_1 obj_13 obj_16)
   deleted: (pred_9 obj_13)
   added: (pred_9 obj_16)
   goals met: 0 of 2
3. (op_2 obj_16 obj_01)
   deleted: (pred_4 obj_01 obj_16) (pred_2)
   added: (pred_3 obj_01)
   goals met: 0 of 2
4. (op_1 obj_16 obj_13)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_13)
   goals met: 0 of 2
5. (op_5 obj_13 obj_09 obj_01)
   deleted: (pred_3 obj_01) (pred_4 obj_09 obj_13)
   added: (pred_3 obj_09) (pred_4 obj_01 obj_13)
   goals met: 0 of 2
6. (op_1 obj_13 obj_08)
   deleted: (pred_9 obj_13)
   added: (pred_9 obj_08)
   goals met: 0 of 2
7. (op_1 obj_08 obj_02)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_02)
   goals met: 0 of 2
8. (op_1 obj_02 obj_04)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_04)
   goals met: 0 of 2
9. (op_3 obj_04 obj_17 obj_09 obj_21)
   deleted: (pred_10 obj_17)
   added: (pred_7 obj_17)
   goals met: 0 of 2
10. (op_1 obj_04 obj_02)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_02)
   goals met: 0 of 2
11. (op_4 obj_02 obj_09)
   deleted: (pred_3 obj_09)
   added: (pred_2) (pred_4 obj_09 obj_02)
   goals met: 1 of 2
12. (op_1 obj_02 obj_04)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_04)
   goals met: 1 of 2
13. (op_1 obj_04 obj_17)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_17)
   goals met: 1 of 2
14. (op_1 obj_17 obj_06)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_06)
   goals met: 1 of 2
15. (op_2 obj_06 obj_05)
   deleted: (pred_4 obj_05 obj_06) (pred_2)
   added: (pred_3 obj_05)
   goals met: 1 of 2
16. (op_1 obj_06 obj_17)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_17)
   goals met: 1 of 2
17. (op_1 obj_17 obj_04)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_04)
   goals met: 1 of 2
18. (op_1 obj_04 obj_02)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_02)
   goals met: 1 of 2
19. (op_4 obj_02 obj_05)
   deleted: (pred_3 obj_05)
   added: (pred_2) (pred_4 obj_05 obj_02)
   goals met: 2 of 2
